<?php

namespace Faker\Provider\ne_NEP;

class Address extends \Faker\Provider\Address
{
    protected static $wardNumber = array('##', '#');
    protected static $streetSuffix = array(
        'बाग', 'बजार', 'बेंसी', 'चाेक', 'गाँउ', 'कोट', 'मन्दिर', 'मार्ग', 'नगर', 'शहर', 'स्थान', 'तर'
    );
    protected static $postcode = array('#####');
    // name of districts
    protected static $district = array(
        'भोजपुर', 'धनकुटा', 'इलाम','झापा', 'खोटाँग','मोरंग','ओखलढुंगा ','पांचथर','संखुवासभा',
        'सोलुखुम्बू   ','सुनसरी','ताप्लेजुंग','तेह्रथुम','उदयपुर','सप्तरी','सिराहा','धनुषा',
        'महोत्तरीजिल्ला','सर्लाही','बारा','पर्सा','रौतहट','सिन्धुली','रामेछाप','दोलखा',
        'भक्तपुर','धादिङ','काठमाडौँ','काभ्रेपलान्चोक','ललितपुर','नुवाकोट','रसुवा','सिन्धुपाल्चोक',
        'चितवन','मकवानपुर','बागलुङ','गोरखा','कास्की','लमजुङ','मनाङ','मुस्ताङ','म्याग्दी','नवलपुर',
        'पर्वत','स्याङग्जा','तनहुँ','कपिलवस्तु','परासी','रुपन्देही','अर्घाखाँची','गुल्मी','पाल्पा',
        'दाङ','प्युठान','रोल्पा','पूर्वीरूकुम','बाँके','बर्दिया','पश्चिमीरूकुम','सल्यान','डोल्पा',
        'हुम्ला','जुम्ला','कालिकोट','मुगु','सुर्खेत','दैलेख','जाजरकोट','कैलाली','अछाम','डोटी',
        'बझाङ','बाजुरा','कंचनपुर','डडेलधुरा','बैतडी','दार्चुला'
    );
    // https://ne.wikipedia.org/s/1bl2
    protected static $cityName = array(
       'काठमाडौं','पोखरा','ललितपुर','बिराटनगर','भरतपुर','वीरगञ्ज','बुटवल','धरान','भीमदत्त','धनगढी',
       'जनकपुर','हेटौडा','मध्यपुर','ठिमी','भक्तपुर','दमक','इटहरी','नेपालगंज','त्रियुगा','किर्तिपुर',
       'सिद्धार्थनगर','घोराही','कोहलपुर','बिर्तामोड','लेखनाथ','मेचीनगर','चन्द्रपुर','टीकापुर','गुलरिया',
       'गढिमाई','तुलसीपुर','बिरेन्द्रनगर','मिर्चैया','रत्ननगर','धनुषाधाम','शम्भुनाथ','सप्तरी','व्यास',
       'कलैया','कञ्चनरूप','हरिवन','सुनवल','निलकण्ठ','कमलामाई','राजविराज','उर्लावारी','गौर','छिरेश्वरनाथ',
       'लहान','गैंडाकोट','पृथ्वीनारायण','गौशाला','पुतलीबजार','स्याङ्जा','कार्यविनायक','कपिलवस्तु',
       'राजापुर','बागलुङ','तानसेन','बन्दीपुर','इनरूवा','सिराहा','कटारी','पनौती','बिदुर','धनकुटा',
       'शुक्लगण्डकी','खाँदबारी','रामग्राम','मलङ्वा','फिदिम','बनेपा','बेंसीशहर','वालिङ','जलेश्वर',
       'दिपायल','कुस्मा','पाँचखाल','भिमेश्वर','सन्धिखर्क','बेनी','अमरागढी','नारायण','चम्पापुर',
       'ताप्लेजुङ','इलाम','भद्रपुर','दशरथचन्द','मङ्गलसेन','सल्यान','भोजपुर','म्याङ्लुङ','चौतारा','शंखरपुर',
       'मन्थली*','रेसुङगा','धुलिखेल','प्युठान','साँफेबगर','जयपृथ्वी','चन्दननाथ','दिक्तेल','सुर्योदय',
       'शनि-अर्जुन','कन्काई','बेलवारी','पथरी शनिश्चरे','सुन्दर दुलारी','कोशी हरैंचा','रंगेली','दुहवी-भलुवा',
       'सिद्धिचरण','बेल्टार बसाहा','निजगढ','लालबन्दी','ईश्वरपुर','थाहा','खैरहानी','चित्रवन','कावासोती',
       'देवचुली','बर्दघाट','सैनामैना','लुम्बिनी सांस्कृतिक','देवदह','तिलोत्तमा','कृष्णनगर','शिवराज',
       'शारदा','दुल्लु','लम्की-चुहा','अत्तरिया','अपी','पुनर्वास','बेलौरी','चापाकोट','रामपुर'
    );
    protected static $country = array(
        'अजरबैजान','अफगानिस्तान','आर्मेनिया२','इण्डोनेशिया','ईराक','इजरायल','इरान','उज्बेकिस्तान',
        'उत्तर कोरिया','ओमान','कजाख्स्तान','कतार','कुवेत','कम्बोडिया','किर्गिजस्तान','चीन','जापान',
        'जर्जिया२','ताजिकिस्तान','तुर्कमेनिस्तान','टर्की','थाइल्याण्ड','दक्षिण कोरिया','नेपाल',
        'पाकिस्तान','पूर्वी टिमोर','फिलिपिन्स','बहराइन','बङ्गलादेश','ब्रुनाई','भारत','भूटान','मकाउ३',
        'मलेशिया','मंगोलिया','मालदिभ्स','म्यानमार','यमन','जोर्डन','रूस१','लाओस','लेवनान','भियतनाम',
        'संयुक्त अरब इमिरेट्स','साइप्रस२','साउदी अरब','सिंगापुर','सीरिया','श्रीलङ्का','हङकङ३','अल्बानिया',
        'एण्डोरा','अष्ट्रीया','बेलारुस','बेल्जियम','बोस्निया र हर्जगोविना','बुल्गेरिया','क्रोएसिया',
        'साइप्रस','चेक रिपब्लिक','डेनमार्क','इस्टोनिया','फिनल्याण्ड','फ्रान्स','जर्मनी','जर्जिया',
        'ग्रीस','हंगेरी','आइसल्याण्ड','आयरल्याण्ड','इटाली','लात्भिया','लिश्टेनस्टाईन','लिथुआनिया',
        'लक्जेम्बर्ग','माल्टा(देश)','मोल्दोवा','मोनाको','नेदरल्याण्ड्स','नर्वे','पोल्याण्ड','पोर्चुगल',
        'म्यासेडोनिया','रोमानिया','रुस','सान मरिनो','सर्बिया र मोन्टेनेग्रो','स्लोभाकिया','स्लोभेनिया',
        'स्पेन','स्वीडेन','स्वीट्जरल्याण्ड','युक्रेन','संयुक्त अधिराज्य','भेटिकन सहर','अल्जेरिया','एंगोला',
        'बेनिन','बोत्स्वाना','बुर्किना फासो','बुरुन्डी','क्यामेरून','केप भर्डे','मध्य अफ्रीकी गणतन्त्र','चाड',
        'कोमोरोस','प्रजातान्तृक गणतन्त्र कंगो','गणतन्त्र कंगो','कोत दिभ्वार','जिबुटी','मिश्र',
        'इक्वेटोरियल गिनिया','एरितृया','इथीयोपीया','गाबोन','गाम्बिया','घाना','गिनिया','गिनिया बिसाउ',
        'केन्या','लेसोथो','लाईबेरिया','लिब्या','माडागास्कर','मलावी','माली','ईस्लामी गणतन्त्र माउरीतानीया',
        'मरिसस्','मोरक्को','मोजाम्बिक','नामिबिया','नाईजर','नाईजेरिया','रुवान्डा','साओ तोमे र प्रीन्सिप्',
        'सेनेगल','सीशील्स','सीयेरा लीओन','सोमालिया','दक्षिण अफ्रीका','सुडान','स्वाजिल्याण्ड','तान्जानिया',
        'टोगो','ट्युनिसिया','युगान्डा','जाम्बिया','जिम्बाब्वे','उत्तर अमेरिका','मध्य अमेरिका','ऑस्ट्रेलिया'
    );
     protected static $cityFormats = array(
        '{{cityName}}'
    );
    protected static $streetNameFormats = array(
        '{{firstName}}{{streetSuffix}}',
        '{{lastName}}{{streetSuffix}}'
    );
    protected static $streetAddressFormats = array(
        '{{streetName}}',
    );
    protected static $addressFormats = array(
        "{{city}}-{{wardNumber}}, {{streetAddress}}, {{district}} {{postcode}}",
    );

    /**
     * @example 'Kalaiya'
     */
    public static function cityName()
    {
        return static::randomElement(static::$cityName);
    }

    /**
     * @example '5'
     */
    public static function wardNumber()
    {
        return static::numerify(static::randomElement(static::$wardNumber));
    }

    /**
     * @example 'Bara'
     */
    public static function district()
    {
        return static::randomElement(static::$district);
    }
}
