<?php

namespace Faker\Provider\ne_NEP;

class Text extends \Faker\Provider\Text
{
    
    protected static $textStartsWithUppercase = false;
    
    /**
     * License: Attribution-ShareAlike 3.0 Unported (CC BY-SA 3.0)
     *
     * Title: კაცია-ადამიანი?!
     * Author: ილია ჭავჭავაძე
     * Language: Georgian
     *
     * About Author: http://en.wikipedia.org/wiki/Ilia_Chavchavadze
     *
     * @see http://www.nplg.gov.ge/gsdl/cgi-bin/library.exe?e=q-00000-00---off-0vertwo--00-1----0-10-0---0---0direct-10-DT--4----Doc---0-1l--11-en-50---20-about-%E1%83%AD%E1%83%90%E1%83%95%E1%83%AD%E1%83%90%E1%83%95%E1%83%90%E1%83%AB%E1%83%94+%E1%83%99%E1%83%90%E1%83%AA%E1%83%98%E1%83%90+%E1%83%90%E1%83%93%E1%83%90%E1%83%9B%E1%83%98%E1%83%90%E1%83%9C%E1%83%98--00-3-1-00-0-0-11-1-0utfZz-8-00&a=d&c=vertwo&srp=0&srn=0&cl=search&d=HASH81409ccfa8b32143543b5f
     * @var string
     */
    protected static $baseText = <<<'EOT'
व्हाट इज लोरेम इप्सुम?  लोरेम इप्सुम इज सिम्प्ली दुम्मी टेक्स्ट अफ थे प्रिन्तिङ अन्द टाईपसेत्तिङ इन्दुस्त्री। 
लोरेम इप्सुम हस बीन थे इन्दुस्त्र्य्स स्ट्यान्डर्ड दुम्मी टेक्स्ट एवेर सिन्के थे १५००स, व्हेन अन उन्क्नोव्न 
प्रिन्तेर तूक अ गल्लीए अफ टाईप अन्द स्क्रम्ब्लेद इत तो मेक अ टाईप स्पेकिमेन बुक। इत हस सुर्विवेद नट ओन्ली 
फाइभ केन्तुरिएस, बुत अल्सो थे लेअप इन्तो एलेक्त्रोनिक टाईपसेत्तिङ, रिमेनिङ एस्सेन्तिअल्ली उन्चङेद। इत वस 
पोपुलरिसेद इन थे १९६०स विथ थे रिलिज अफ लेत्रसेत शीत्स कोन्तैनिङ लोरेम इप्सुम पस्सगेस, अन्द मोरे रेकेन्त्ली 
विथ डेस्कटप पुब्लिशिङ सफ्टवेर लाइक अल्दुस पेजमकेर इन्क्लुदिङ वेर्सिओन्स अफ लोरेम इप्सुम। व्हाइ दो वे उसे 
इत?  इत इज अ लोङ एस्तब्लिशेद फक्त थत अ रिडएर विल्ल बे दिस्त्रक्तेद बी थे रिडेबल कोन्तेन्त अफ अ पेज व्हेन 
लूकिङ अत इत्स लयोउत। ठे पोइन्ट अफ उसिङ लोरेम इप्सुम इज थत इत हस अ मोरे-ओर्-लेस्स नोर्मल दिस्त्रिबुतिओन 
अफ लेटरस, अस ओप्पोसेद तो उसिङ कोन्तेन्त हियर, कोन्तेन्त हियर, मकिङ इत लूक लाइक रिडेबल ईंग्लिश। मनी 
डेस्कटप पुब्लिशिङ पक्कगेस अन्द वेब पेज एडिटओर्स नोव उसे लोरेम इप्सुम अस थेइर देफौल्त मोडेल टेक्स्ट, 
अन्द अ सर्च फोर लोरेम इप्सुम विल्ल उन्कोवेर मनी वेब सितेस स्तिल्ल इन थेइर इन्फ्यानकी। वारीओुस वेर्सिओन्स 
हवे एवोल्वेद ओवेर थे एअर्स, सोमेतिमेस बी एक्सिडेन्ट, सोमेतिमेस ओन पुर्पोसे (इन्जेक्तेद हुमोउर अन्द थे लाइक)।  
व्हेरे दोएस इत कम फ्रम?  कोन्त्ररी तो पोपुलर बेलिएफ, लोरेम इप्सुम इज नट सिम्प्ली रन्दोम टेक्स्ट। इत हस रूत्स इन 
अ पीस अफ क्लासइकल लतिन लितेरतुरे फ्रम ४५ ब्क, मकिङ इत ओवेर २००० एअर्स ओल्द। रिचार्द म्क्क्लिन्तोक्क, अ लतिन 
प्रोफेसर अत हम्प्देन्-स्य्द्नीए कलेज इन भर्जीनिया, लूकेद अप वन अफ थे मोरे ओब्स्कुरे लतिन वोर्द्स, 
कोन्सेक्तेतुर, फ्रम अ लोरेम इप्सुम पस्सगे, अन्द गोइङ थ्रोउघ थे कितेस अफ थे वर्ड इन क्लासइकल लितेरतुरे, 
दिस्कोवेरेद थे उन्दोउब्टेबल सोउर्के। लोरेम इप्सुम कोमेस फ्रम सेक्तिओन्स १।१०।३२ अन्द १।१०।३३ अफ दे फिनिबुस 
बोनोरुम एत मलोरुम (ठे एक्स्त्रेमेस अफ गूड् अन्द एविल) बी किकेरो, व्रित्तेन इन ४५ ब्क। दिस बुक इज अ त्रेअतिसे 
ओन थे थेओरी अफ एथिक्स, वेरी पोपुलर दुरिङ्ग थे रेनैस्सन्के। ठे फर्स्ट लिने अफ लोरेम इप्सुम, लोरेम इप्सुम 
दोलोर सित अंेत।।, कोमेस फ्रम अ लिने इन सेक्तिओन १।१०।३२।  ठे स्ट्यान्डर्ड चुन्क अफ लोरेम इप्सुम उसेद सिन्के 
थे १५००स इज रेप्रोदुकेद बेलोव फोर थोसे इन्तेरेस्तेद। सेक्तिओन्स १।१०।३२ अन्द १।१०।३३ फ्रम दे फिनिबुस बोनोरुम एत 
मलोरुम बी किकेरो आर अल्सो रेप्रोदुकेद इन थेइर एक्सक्त ओरिगिनल फोर्म, अक्कोम्पनिएद बी ईंग्लिश वेर्सिओन्स 
फ्रम थे १९१४ त्रन्स्लतिओन बी यच। रक्खम। व्हेरे क्यान आइ गेट सोमे?  ठेरे आर मनी वारीअतिओन्स अफ पस्सगेस अफ 
लोरेम इप्सुम अवैलब्ले, बुत थे मजोरिती हवे सुफ्फेरेद अल्तेरतिओन इन सोमे फोर्म, बी इन्जेक्तेद हुमोउर, ओर 
रन्दोमिसेद वोर्द्स व्हिच दोन्त लूक एवेन स्लाईटली बेलिएवब्ले। इफ यू आर गोइङ तो उसे अ पस्सगे अफ लोरेम 
इप्सुम, यू नीद तो बे सुरे थेरे इस्न्त अन्य्थिङ एम्बर्‍अस्सिङ हिद्देन इन थे मिडल अफ टेक्स्ट। अल्ल थे लोरेम 
इप्सुम गेनेरतोर्स ओन थे ईन्टरनेट तेन्द तो रेपेअत प्रेदेफिनेद चुन्क्स अस नेकेस्सरी, मकिङ दिस थे फर्स्ट त्रुए 
गेनेरतोर ओन थे ईन्टरनेट। इत उसेस अ दिक्तिओनरी अफ ओवेर २०० लतिन वोर्द्स, कोम्बिनेद विथ अ हन्द्फुल अफ मोडेल 
सेन्तेन्के स्त्रुक्तुरेस, तो गेनेरते लोरेम इप्सुम व्हिच लूक्स रेअसनअब्ले। ठे गेनेरतेद लोरेम इप्सुम इज थेरेफोरे 
अल्वय्स फ्री फ्रम रेपेतितिओन, इन्जेक्तेद हुमोउर, ओर नोन्-चरक्तेरिस्तिक वोर्द्स एत्क।
EOT;
}
